Revit 2024 API
FabricationPart.Weight Property
 The weight of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double Weight { get; }
Visual Basic
Public ReadOnly Property Weight As Double
	Get
Visual C++
public:
property double Weight {
	double get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace